hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_qspi.h
    @param[in] p_reg Pointer to the peripheral register structure.
    @param[in] task  Task to activate.
*/
__STATIC_INLINE void nrf_qspi_task_trigger(NRF_QSPI_Type *p_reg, nrf_qspi_task_t task);

/**
    @brief Function for getting the address of a specific QSPI task register.

    @param[in] p_reg Pointer to the peripheral register structure.
    @param[in] task  Requested task.

    @return Address of the specified task register.
*/
__STATIC_INLINE uint32_t nrf_qspi_task_address_get(NRF_QSPI_Type const *p_reg,
                                                   nrf_qspi_task_t       task);
                                                   
/**
    @brief Function for clearing a specific QSPI event.

    @param[in] p_reg      Pointer to the peripheral register structure.
    @param[in] qspi_event Event to clear.
*/
__STATIC_INLINE void nrf_qspi_event_clear(NRF_QSPI_Type   *p_reg, nrf_qspi_event_t qspi_event);

/**
    @brief Function for checking the state of a specific SPI event.

    @param[in] p_reg      Pointer to the peripheral register structure.
    @param[in] qspi_event Event to check.

    @retval true  If the event is set.
    @retval false If the event is not set.
*/
__STATIC_INLINE bool nrf_qspi_event_check(NRF_QSPI_Type const *p_reg, nrf_qspi_event_t qspi_event);

/**
    @brief Function for getting the address of a specific QSPI event register.

    @param[in] p_reg      Pointer to the peripheral register structure.
    @param[in] qspi_event Requested event.

    @return Address of the specified event register.
*/
__STATIC_INLINE uint32_t *nrf_qspi_event_address_get(NRF_QSPI_Type const *p_reg,
                                                     nrf_qspi_event_t      qspi_event);
                                                     
/**
    @brief Function for enabling specified interrupts.

    @param[in] p_reg          Pointer to the peripheral register structure.
    @param[in] qspi_int_mask  Interrupts to enable.
*/
__STATIC_INLINE void nrf_qspi_int_enable(NRF_QSPI_Type *p_reg, uint32_t qspi_int_mask);

/**
    @brief Function for disabling specified interrupts.

    @param[in] p_reg          Pointer to the peripheral register structure.
    @param[in] qspi_int_mask  Interrupts to disable.
*/
__STATIC_INLINE void nrf_qspi_int_disable(NRF_QSPI_Type *p_reg, uint32_t qspi_int_mask);

/**
    @brief Function for retrieving the state of a given interrupt.

    @param[in] p_reg    Pointer to the peripheral register structure.
    @param[in] qspi_int Interrupt to check.

    @retval true  If the interrupt is enabled.
    @retval false If the interrupt is not enabled.
*/
__STATIC_INLINE bool nrf_qspi_int_enable_check(NRF_QSPI_Type const *p_reg,
                                               nrf_qspi_int_mask_t   qspi_int);
                                               
/**
    @brief Function for enabling the QSPI peripheral.

    @param[in] p_reg Pointer to the peripheral register structure.
*/
__STATIC_INLINE void nrf_qspi_enable(NRF_QSPI_Type *p_reg);

/**
    @brief Function for disabling the QSPI peripheral.

    @param[in] p_reg Pointer to the peripheral register structure.
*/
__STATIC_INLINE void nrf_qspi_disable(NRF_QSPI_Type *p_reg);

/**
    @brief Function for configuring QSPI pins.

    If a given signal is not needed, pass the @ref NRF_QSPI_PIN_NOT_CONNECTED
    value instead of its pin number.

    @param[in] p_reg  Pointer to the peripheral register structure.
    @param[in] p_pins Pointer to the pins configuration structure. See @ref nrf_qspi_pins_t.
*/
__STATIC_INLINE void nrf_qspi_pins_set(NRF_QSPI_Type          *p_reg,
                                       const nrf_qspi_pins_t *p_pins);
                                       
/**
    @brief Function for setting the QSPI XIPOFFSET register.

    @param[in] p_reg      Pointer to the peripheral register structure.
    @param[in] xip_offset Address offset in the external memory for Execute in Place operation.
*/
__STATIC_INLINE void nrf_qspi_xip_offset_set(NRF_QSPI_Type *p_reg,
                                             uint32_t        xip_offset);
                                             
/**
    @brief Function for setting the QSPI IFCONFIG0 register.

    @param[in] p_reg    Pointer to the peripheral register structure.
    @param[in] p_config Pointer to the QSPI protocol interface configuration structure. See @ref nrf_qspi_prot_conf_t.
*/
__STATIC_INLINE void nrf_qspi_ifconfig0_set(NRF_QSPI_Type               *p_reg,
                                            const nrf_qspi_prot_conf_t *p_config);
                                            
/**
    @brief Function for setting the QSPI IFCONFIG1 register.

    @param[in] p_reg    Pointer to the peripheral register structure.
    @param[in] p_config Pointer to the QSPI physical interface configuration structure. See @ref nrf_qspi_phy_conf_t.
*/
__STATIC_INLINE void nrf_qspi_ifconfig1_set(NRF_QSPI_Type              *p_reg,
                                            const nrf_qspi_phy_conf_t *p_config);
                                            
/**
    @brief Function for setting the QSPI ADDRCONF register.

    Function must be executed before sending task NRF_QSPI_TASK_ACTIVATE. Data stored in the structure
    is sent during the start of the peripheral. Remember that the reset instruction can set
    addressing mode to default in the memory device. If memory reset is necessary before configuring
    the addressing mode, use custom instruction feature instead of this function.
    Case with reset: Enable the peripheral without setting ADDRCONF register, send reset instructions
    using a custom instruction feature (reset enable and then reset), set proper addressing mode
    using the custom instruction feature.

    @param[in] p_reg    Pointer to the peripheral register structure.
    @param[in] p_config Pointer to the addressing mode configuration structure. See @ref nrf_qspi_addrconfig_conf_t.
*/
__STATIC_INLINE void nrf_qspi_addrconfig_set(NRF_QSPI_Type                     *p_reg,
                                             const nrf_qspi_addrconfig_conf_t *p_config);
                                             
/**
    @brief Function for setting write data into the peripheral register (without starting the process).

    @param[in] p_reg     Pointer to the peripheral register structure.
    @param[in] p_buffer  Pointer to the writing buffer.
    @param[in] length    Lenght of the writing data.
    @param[in] dest_addr Address in memory to write to.
*/
__STATIC_INLINE void nrf_qspi_write_buffer_set(NRF_QSPI_Type *p_reg,
                                               void const     *p_buffer,
                                               uint32_t        length,
                                               uint32_t        dest_addr);
                                               
/**
    @brief Function for setting read data into the peripheral register (without starting the process).

    @param[in]  p_reg    Pointer to the peripheral register structure.
    @param[out] p_buffer Pointer to the reading buffer.
    @param[in]  length   Length of the read data.
    @param[in]  src_addr Address in memory to read from.
*/
__STATIC_INLINE void nrf_qspi_read_buffer_set(NRF_QSPI_Type *p_reg,
                                              void           *p_buffer,
                                              uint32_t        length,
                                              uint32_t        src_addr);
                                              
/**
    @brief Function for setting erase data into the peripheral register (without starting the process).

    @param[in] p_reg      Pointer to the peripheral register structure.
    @param[in] erase_addr Start address to erase. Address must have padding set to 4 bytes.
    @param[in] len        Size of erasing area.
*/
__STATIC_INLINE void nrf_qspi_erase_ptr_set(NRF_QSPI_Type       *p_reg,
                                            uint32_t             erase_addr,
                                            nrf_qspi_erase_len_t len);
                                            
/**
    @brief Function for getting the peripheral status register.

